{
  "/en/": {
    "title": "AWS Certified Developer - Associate - Exam preparation notes",
    "content": "\r\n**AWS Certified Developer - Associate** showcases skills and knowledge in developing, optimizing, packaging, and deploying applications, using CI/CD workflows, and identifying and resolving application issues. This certification is a good starting point on the AWS Certification journey for individuals in IT or cloud developer job roles.\r\n\r\n# Who should take this exam?\r\n\r\nPer the exam guide, one or more years of prior hands-on experience is recommended in developing and maintaining applications by using AWS services. This certification is an ideal starting point on the AWS Certification journey for individuals in IT or cloud developer job roles.\r\n\r\nCandidates who do not have any IT work experience would benefit from first earning the AWS Certified Cloud Practitioner to get foundational knowledge of AWS Cloud and services before attempting the AWS Certified Developer - Associate exam.\r\n\r\nCandidates who do not have any IT work experience would benefit from first earning the AWS Certified Cloud Practitioner to get foundational knowledge of AWS Cloud and services before attempting the AWS Certified Developer - Associate exam.\r\n\r\n# How will the AWS Certified Developer - Associate help my career?\r\n\r\nCertified individuals report increased confidence as a result of earning this industry-recognized certification and increased credibility with technical IT/cloud colleagues and customers. Preparing for and earning the AWS Certified Developer - Associate can get you off to a strong start to earn additional AWS Certifications in the Professional and Specialty categories.\r\n\r\n# What certification(s) should I earn next after AWS Certified Developer - Associate?\r\n\r\nThe AWS Certified SysOps Administrator - Associate and AWS Certified DevOps Engineer - Professional are certifications that other cloud professionals have earned to advance further in roles like cloud DevOps engineer and software development engineer. Cloud professionals have also earned the AWS Certified Data Engineer- Associate to advance toward roles like machine learning engineer. View AWS Certification paths to learn more and plan your AWS Certification journey.\r\n\r\n# How long is this certification valid for?\r\n\r\nThis certification is valid for 3 years. Before your certification expires, you can recertify by passing the latest version of this exam, or by earning the AWS Certified DevOps Engineer - Professional, which will automatically recertify this Associate-level certification. Learn more about recertification options for AWS Certifications.\r\n\r\n# What can this documentation do ?\r\n\r\nThis documentation provides you with a condensed version of whatever knowledge required to get through the DVA-C02 exam. However, this does not contain all knowledge, some might not be detailed due to this being mostly a personal documentation. You can send an Issue in the GitHub Repo of this documentation in case errors/misinformation was found, which is highly appreciated.\r\n\r\n# Now that you know it...\r\n\r\nCloud or Belize, where would you wanna go ?\r\n\r\n![Pinkman](/images/homepage/jessewannacook.jpg)",
    "lastmodified": "2024-12-06T18:42:26.343134+07:00",
    "tags": []
  },
  "/en/preparation/": {
    "title": "Prepare your environment",
    "content": "\r\nYou can't just learn about the cloud platform without creating an account and use the platform yourself, right ?\r\n\r\nThat's why we have a few steps to go through here.\r\n\r\n\u003e [!note] Note\r\n\u003e\r\n\u003e Some images contains older AWS UI due to being taken from others' videos or block. This is unwanted and inevitable due to my accounts having been set up and some processes can't be reversed.\r\n\r\n# Prepare your AWS Account\r\n## Create an AWS Account\r\n\r\n\u003e [!note] Note\r\n\u003e\r\n\u003e If you already have an AWS account, skip to [Sign in to your AWS root Account](#sign-in-to-your-aws-root-account).\r\n\u003e\r\n\u003e If you also have an IAM user already, skip to [Sign in to your IAM user](#sign-in-to-your-iam-user).\r\n\r\n\u003e [!info] Info\r\n\u003e\r\n\u003e You are required to have either a credit or a debit card with international payment support, issued by one of the following: Visa, Mastercard, American Express. Consider applying to have your card issued before creating an AWS Account.\r\n\r\nGo to the [AWS Homepage](https://aws.amazon.com/).\r\n\r\nClick on the **Create an AWS Account** button.\r\n\r\n![AWS-Home](/images/preparation/01-0001.png)\r\n\r\nAt the **Sign up for AWS** screen, enter your information and click **Verify email address**.\r\n\r\n![AWS-Signup](/images/preparation/01-0002.png)\r\n\r\nFind the e-mail with the verification code.\r\n\r\n![AWS-Vericode-Mail](/images/preparation/01-0004.png)\r\n\r\nEnter the verification code.\r\n\r\n![AWS-Verification](/images/preparation/01-0003.png)\r\n\r\nAt the **Contact information** page:\r\n\r\n- Check **Personal - For your own projects**\r\n- Enter your contact information\r\n\r\n![Contact Information](/images/preparation/01-0005.png)\r\n\r\nAt **Billing information**, enter your card number and other informations on your card.\r\n\r\n![Billing information](/images/preparation/01-0006.png)\r\n\r\nFor the final step, you're required to confirm your identity. Choose your confirmation method and enter your country code.\r\n\r\n![confirm your identity](/images/preparation/01-0007.png)\r\n\r\n![confirm your identity](/images/preparation/01-0008.png)\r\n\r\nChoose a support plan. As a learner, I would just choose the free Basic plan. You can always change your support plan later.\r\n\r\n![support plan](/images/preparation/01-0009.png)\r\n\r\nOkay, at this point, the account creation process is done. Now you'll have to sign in to your account.\r\n\r\n## Sign in to your AWS root Account\r\n\r\nEnter [this link](https://console.aws.amazon.com/console/home?nc2=h_ct\u0026src=header-signin) to sign in to your account.\r\n\r\nAlternatively, you can sign in from the AWS home page.\r\n\r\n![sign in](/images/preparation/01-1001.png)\r\n\r\nOn the sign in page, click the **Sign in using root user email** button.\r\n\r\n![sign in](/images/preparation/01-1002.png)\r\n\r\nEnter your e-mail address on the next page.\r\n\r\n![root sign in](/images/preparation/01-1003.png)\r\n\r\nEnter the captcha for human verification.\r\n\r\n![root sign in captcha](/images/preparation/01-1004.png)\r\n\r\nEnter the password, then sign in.\r\n\r\n![password](/images/preparation/01-1005.png)\r\n\r\nNow you're in, but we're not there yet.\r\n\r\n![AWS Console](/images/preparation/01-1006.png)\r\n\r\n## Secure your AWS Root Account with MFA\r\n\r\nEnter the [Identity \u0026 Access Management (IAM) Console](console.aws.amazon.com/iam/home)\r\n\r\nYou'll be prompted to add MFA for your Root user. Click **Add MFA**\r\n\r\n![IAM Console](/images/preparation/01-1007.png)\r\n\r\nOn the **Security Credentials** page, click **Assign MFA**\r\n\r\n![IAM Console](/images/preparation/01-1008.png)\r\n\r\nProceed with the MFA Creation\r\n\r\n![MFA](/images/preparation/01-1009.png)\r\n\r\n\u003e [!note] Note\r\n\u003e\r\n\u003e You can either use a browser extension, or an app on your phone for authentification.\r\n\r\nAfter assigning MFA to your root account, the prompt at the main IAM console will look like this:\r\n\r\n![IAM Dash](/images/preparation/01-1010.png)\r\n\r\n## Create an IAM administrative user\r\n\r\nLet's create a user with Administrator Access. I'll call it _\"administraitor\"_ (no typo, let's hope he'll never break bad and turn into a traitor).\r\n\r\n![IAM Admin](/images/preparation/01-1011.png)\r\n\r\nProceed through all steps with the orange button (or whatever non-white button).\r\n\r\n![IAM Admin](/images/preparation/01-1012.png)\r\n![IAM Admin](/images/preparation/01-1013.png)\r\n\r\nOh yes, the group creation dialog. You can add the _**AdministratorAccess**_ policy for convinience, or create a policy yourself.\r\n\r\n![IAM Admin](/images/preparation/01-1014.png)\r\n![IAM Admin](/images/preparation/01-1015.png)\r\n\r\nNow we're almost done. SAVE YOUR PASSWORD SOMEWHERE ! You're responsible for keeping it.\r\n\r\n![IAM Admin](/images/preparation/01-1016.png)\r\n\r\nGood ! Now your account is ready for the first cook !\r\n\r\n## Sign in to your IAM user\r\n\r\nThe shortcut link is [here](https://signin.aws.amazon.com/console), for your convinience.\r\n\r\nThe process is much simpler now, enter what you need and click **Sign in**\r\n\r\n![IAM Admin](/images/preparation/01-1017.png)\r\n\r\n# Prepare your tools\r\n\r\nTo proceed with the hands-on labs in the course, it is recommended to have these tools:\r\n\r\n- A computer with an operating system and network connection of course (heheh). But hey, for some reasons, Linux is prefered for these kinds of work.\r\n\r\n- Any up-to-date browser\r\n\r\n- An IDE or code editor. In my illustrations, I'll use Visual Studio Code with the AWS Toolkit installed.\r\n\r\n- AWS CLI v2\r\n\r\n# Hands-on source code\r\n\r\nGet the source code [here](https://github.com/nealdct/aws-dva-code)\r\n\r\nYou can clone the repository using the Git command:\r\n\r\n```bash\r\ngit clone https://github.com/nealdct/aws-dva-code.git\r\n```\r\n\r\n**Congratulations !** Now you're ready to cook your own knowledge.\r\n\r\n![Mr. White](/images/homepage/waltercook.jpg)",
    "lastmodified": "2024-12-06T18:40:55.2009313+07:00",
    "tags": []
  }
}