{
  "/_index.en": {
    "title": "AWS Certified Developer - Associate - Exam preparation note",
    "content": "\r\n**AWS Certified Developer - Associate** showcases skills and knowledge in developing, optimizing, packaging, and deploying applications, using CI/CD workflows, and identifying and resolving application issues. This certification is a good starting point on the AWS Certification journey for individuals in IT or cloud developer job roles.\r\n\r\n# Who should take this exam?\r\n\r\nPer the exam guide, one or more years of prior hands-on experience is recommended in developing and maintaining applications by using AWS services. This certification is an ideal starting point on the AWS Certification journey for individuals in IT or cloud developer job roles.\r\n\r\nCandidates who do not have any IT work experience would benefit from first earning the AWS Certified Cloud Practitioner to get foundational knowledge of AWS Cloud and services before attempting the AWS Certified Developer - Associate exam.\r\n\r\nCandidates who do not have any IT work experience would benefit from first earning the AWS Certified Cloud Practitioner to get foundational knowledge of AWS Cloud and services before attempting the AWS Certified Developer - Associate exam.\r\n\r\n# How will the AWS Certified Developer - Associate help my career?\r\n\r\nCertified individuals report increased confidence as a result of earning this industry-recognized certification and increased credibility with technical IT/cloud colleagues and customers. Preparing for and earning the AWS Certified Developer - Associate can get you off to a strong start to earn additional AWS Certifications in the Professional and Specialty categories.\r\n\r\n# What certification(s) should I earn next after AWS Certified Developer - Associate?\r\n\r\nThe AWS Certified SysOps Administrator - Associate and AWS Certified DevOps Engineer - Professional are certifications that other cloud professionals have earned to advance further in roles like cloud DevOps engineer and software development engineer. Cloud professionals have also earned the AWS Certified Data Engineer- Associate to advance toward roles like machine learning engineer. View AWS Certification paths to learn more and plan your AWS Certification journey.\r\n\r\n# How long is this certification valid for?\r\n\r\nThis certification is valid for 3 years. Before your certification expires, you can recertify by passing the latest version of this exam, or by earning the AWS Certified DevOps Engineer - Professional, which will automatically recertify this Associate-level certification. Learn more about recertification options for AWS Certifications.\r\n\r\n# What can this documentation do ?\r\n\r\nThis documentation provides you with a condensed version of whatever knowledge required to get through the DVA-C02 exam. However, this does not contain all knowledge, some might not be detailed due to this being mostly a personal documentation. You can send an Issue in the GitHub Repo of this documentation in case errors/misinformation was found, which is highly appreciated.",
    "lastmodified": "2024-11-25T14:29:10.0825597+07:00",
    "tags": []
  },
  "/preparation/_index.en": {
    "title": "Prepare your environment",
    "content": "\r\nYou can't just learn about the cloud platform without creating an account and use the platform yourself, right ?\r\n\r\nThat's why we have a few steps to go through here.",
    "lastmodified": "2024-11-25T14:28:22.0650873+07:00",
    "tags": []
  }
}